IS_TELESCOPE = """При соединении секций многогранных опор с помощью телескопического стыка \
ориентировочная длина стыка принимается в зависимости от диаметров \
соединяемых секций: равной полутора - двум диаметрам. Данный размер \
уточняется расчетом. Конструкции опор с телескопическим соединением \
имеют детали для стягивания секций опоры и обеспечения плотной посадки. \
Стягивание секций рекомендуется производить возрастающей нагрузкой с шагом, \
зависящим от диаметра соединяемых секций, до прекращения перемещения секций \
относительно друг друга.
"""

POLE_TYPE_TEXT_1 = """анкерные опоры должны быть жесткой конструкции. К опорам жесткой конструкции \
относятся опоры, отклонение верха которых (без учета поворота фундаментов) \
при воздействии расчетных нагрузок по второй группе предельных состояний \
не превышает 1/100 высоты опоры.
"""

POLE_TYPE_TEXT_2 = """промежуточные опоры не нормируются по отклонению.
"""

ALLOWABLE_DEFLECTION = """Отклонение опоры не превышает предельное значение, равное {deflection} мм (1/100 высоты опоры). 
"""

typical_ground_dict = {
            "Песок Крупный (e = 0.45)": {
                "ф": "43",
                "C": "2",
                "y": "2",
                "E": "50000"
            },
            "Песок Крупный (e = 0.65)": {
                "ф": "35",
                "C": "1",
                "y": "1,9",
                "E": "30000"
            },
            "Песок Мелкий (e = 0.45)": {
                "ф": "38",
                "C": "6",
                "y": "1,9",
                "E": "48000"
            },
            "Песок Мелкий (e = 0.75)": {
                "ф": "28",
                "C": "0",
                "y": "1,8",
                "E": "18000"
            },
            "Песок Пылеватый (e = 0.45)": {
                "ф": "36",
                "C": "8",
                "y": "1,8",
                "E": "39000"
            },
            "Песок Пылеватый (e = 0.75)": {
                "ф": "26",
                "C": "2",
                "y": "1,8",
                "E": "11000"
            },
            "Супесь (e = 0.45)": {
                "ф": "30",
                "C": "21",
                "y": "2",
                "E": "32000"
            },
            "Супесь (e = 0.65)": {
                "ф": "27",
                "C": "15",
                "y": "1,9",
                "E": "16000"
            },
            "Супесь (e = 0.85)": {
                "ф": "18",
                "C": "9",
                "y": "1,7",
                "E": "9000"
            },
            "Суглинок (e = 0.45)": {
                "ф": "26",
                "C": "47",
                "y": "2",
                "E": "34000"
            },
            "Суглинок (e = 0.65)": {
                "ф": "24",
                "C": "31",
                "y": "1,9",
                "E": "22000"
            },
            "Суглинок (e = 0.85)": {
                "ф": "19",
                "C": "18",
                "y": "1,8",
                "E": "11000"
            },
            "Суглинок (e = 1.05)": {
                "ф": "12",
                "C": "12",
                "y": "1,8",
                "E": "5000"
            },
            "Глина (e = 0.55)": {
                "ф": "21",
                "C": "81",
                "y": "1,8",
                "E": "28000"
            },
            "Глина (e = 0.75)": {
                "ф": "19",
                "C": "54",
                "y": "1,8",
                "E": "21000"
            },
            "Глина (e = 0.95)": {
                "ф": "14",
                "C": "37",
                "y": "1,7",
                "E": "12000"
            },
            "Глина (e = 1.05)": {
                "ф": "7",
                "C": "29",
                "y": "1,7",
                "E": "7000"
            }
        }