IS_TELESCOPE = """При соединении секций многогранных опор с помощью телескопического стыка \
ориентировочная длина стыка принимается в зависимости от диаметров \
соединяемых секций: равной полутора - двум диаметрам. Данный размер \
уточняется расчетом. Конструкции опор с телескопическим соединением \
имеют детали для стягивания секций опоры и обеспечения плотной посадки. \
Стягивание секций рекомендуется производить возрастающей нагрузкой с шагом, \
зависящим от диаметра соединяемых секций, до прекращения перемещения секций \
относительно друг друга.
"""

POLE_TYPE_TEXT_1 = """анкерные опоры должны быть жесткой конструкции. К опорам жесткой конструкции \
относятся опоры, отклонение верха которых (без учета поворота фундаментов) \
при воздействии расчетных нагрузок по второй группе предельных состояний \
не превышает 1/100 высоты опоры.
"""

POLE_TYPE_TEXT_2 = """промежуточные опоры не нормируются по отклонению.
"""

ALLOWABLE_DEFLECTION = """Отклонение опоры не превышает предельное значение, равное {deflection} мм (1/100 высоты опоры). 
"""