IS_TELESCOPE = """
При соединении секций многогранных опор с помощью телескопического стыка \
ориентировочная длина стыка принимается в зависимости от диаметров \
соединяемых секций: равной полутора - двум диаметрам. Данный размер \
уточняется расчетом. Конструкции опор с телескопическим соединением \
имеют детали для стягивания секций опоры и обеспечения плотной посадки. \
Стягивание секций рекомендуется производить возрастающей нагрузкой с шагом, \
зависящим от диаметра соединяемых секций, до прекращения перемещения секций \
относительно друг друга.
"""